* [Documentation](https://github.com/mkleehammer/pyodbc/wiki)
* [Documentation](https://github.com/mkleehammer/pyodbc/wiki/Connecting-to-Microsoft-Access)
* [Video](https://www.youtube.com/watch?v=MIMEW9v4B4c)
* [Reference](https://datatofish.com/how-to-connect-python-to-ms-access-database-using-pyodbc/)

In [ ]:
# !pip install pyodbc

In [1]:
import pyodbc
[x for x in pyodbc.drivers() if x.startswith('Microsoft Access Driver')]

conn_str = (
    r'DRIVER={Microsoft Access Driver (*.mdb, *.accdb)};'
    r'DBQ=D:\SQL\ASSIGNMENTS\SESSION 3 & 4 ASSIGNMENTS\SQLCASE 1\Database1.accdb;'
    )
# "D:\SQL\ASSIGNMENTS\SESSION 3 & 4 ASSIGNMENTS\SQLCASE 1\Database1.accdb"
cnxn = pyodbc.connect(conn_str)
crsr = cnxn.cursor()
for table_info in crsr.tables(tableType='TABLE'):
    print(table_info.table_name)
crsr.execute('SELECT * FROM BIO')
for row in crsr.fetchall(): 
    print(row)

BIO
CHE
machinary
PHY
Student
('007', 'NAVEEN', 'M', '1A')
('001', 'SHANKAR', 'M', '1A')
('006', 'SUBATHRA', 'F', '2C')
('008', 'ARAVINTH', 'M', '1B')
('005', 'SAMPATH', 'M', '2B')
('003', 'SHRIRAM', 'M', '1C')

In [2]:
for row in crsr.columns(table='machinary'):
    print (row.column_name)

PartNumber
Description
Quantity
Supplier
datepur

In [3]:
crsr.execute('SELECT * FROM CHE')
for row in crsr.fetchall(): 
    print(row)

('001', 'SHANKAR', 'M', '1A')
('002', 'HARI', 'M', '1B')
('003', 'SHRIRAM', 'M', '1C')
('004', 'SIDDHU', 'M', '2A')
('005', 'SAMPATH', 'M', '2B')

In [4]:
crsr.execute('SELECT * FROM machinary')
for row in crsr.fetchall(): 
    print(row)

(7, 'pipe wrinch', 100, 'Sid Steels', None)
(8, 'cutting plier', 100, 'China Metals Co', None)
(0, 'Shaft', 75, 'Sid Steels', None)
(6, 'Raw Material', 60, 'Sid Steels', None)

In [5]:
for row in crsr.columns(table='machinary'):
    print (row.column_name)

PartNumber
Description
Quantity
Supplier
datepur

In [6]:
crsr.execute('SELECT quantity FROM machinary ORDER BY quantity')
for row in crsr.fetchall(): 
    print(row)

(60, )
(75, )
(100, )
(100, )

In [7]:
crsr.execute('SELECT * FROM BIO')
for row in crsr.fetchall(): 
    print(row)
# crsr.execute("DROP TABLE TEST CASCADE")
# crsr.close()
# cnxn.close()

('007', 'NAVEEN', 'M', '1A')
('001', 'SHANKAR', 'M', '1A')
('006', 'SUBATHRA', 'F', '2C')
('008', 'ARAVINTH', 'M', '1B')
('005', 'SAMPATH', 'M', '2B')
('003', 'SHRIRAM', 'M', '1C')

In [8]:
crsr.execute('SELECT fullname, dcode FROM student')
for row in crsr.fetchall(): 
    print(row)

('Hari', 'tst')
('tharamani', 'ece')
('Sheeiram', 'ice')
('shankar', 'ice')
('sid', 'ece')
('siddhu', 'ece')
('Sampath', 'eee')
('Subathra', 'tst')
('kanmani', 'eee')
('Tynaveen', 'tst')
('aravinth', 'ece')
(None, '0')

In [9]:
import pandas as pd
tableResult = pd.read_sql("SELECT * FROM student", cnxn) 
tableResult

C:\Users\HP\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

    ID   fullname         dob   sex class hcode  mtest dcode
0    1       Hari  09/04/1995     M    1A     R     78   tst
1    2  tharamani  12/02/1986     M    1A     Y     45   ece
2    3   Sheeiram  26/11/1994     M    2A     B     36   ice
3    4    shankar  26/03/1995     M    3A     G     82   ice
4    5        sid  19/03/1995     M    2A     G     91   ece
5    6     siddhu  19/03/1995     M    1A     G     81   ece
6    7    Sampath  25/05/1958     M    3B     B     71   eee
7    8   Subathra  30/11/1964     F    2B     R     61   tst
8    9    kanmani  21/05/1993     M    1B     R     51   eee
9   10   Tynaveen  23/01/1995     M    1B     Y    100   tst
10  11   aravinth  26/03/1995     M    2B     B     90   ece
11  13       None        None  None  None  None      0     0

In [10]:
tableResult[tableResult['sex'] == 'F']

  ID  fullname         dob sex class hcode  mtest dcode
7  8  Subathra  30/11/1964   F    2B     R     61   tst

In [11]:
tableResult.to_excel("FileExample.xlsx",sheet_name='Results')

In [12]:
pwd

'C:\\Users\\HP\\Python\\MSME\\MSME - Python'